cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'wagoodman/dive'
tap 'valelint/vale'
tap 'azure/functions'
tap 'netlify/netlifyctl'
tap 'amazeeio/lagoon-cli'

# Required apps before installing others.
cask 'xquartz'
brew 'mas'

# Brew apps
brew 'git'
brew 'hub'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yarn'
brew 'cmake'
brew 'asciinema'
brew 'rethinkdb'
brew 'exiftool'
brew 'php'
brew 'php-cs-fixer'
brew 'fribidi'
brew 'dive'
brew 'tree'
brew 'wget'
brew 'mariadb'
brew 'direnv'
brew 'ahoy'
brew 'vale'
brew 'tmuxinator'
brew 'git-flow'
brew 'azure-cli'
brew 'github/gh/gh'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'go'
brew 'composer'
brew 'azure-functions-core-tools@3'
brew 'contentful-cli'
brew 'netlifyctl'
brew 'gnupg'
brew 'cloudfoundry/tap/cf-cli'
brew 'lagoon'
brew 'awscli'

# Cask applications
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'tunnelbear'
cask 'vlc'
cask 'insomnia'
cask 'inkscape'
cask 'rocket-chat'
cask 'spotmenu'
cask 'visual-studio-code'
cask 'docker'
cask 'alfred'
cask 'bartender'
cask 'authy'
cask 'kindle'
cask 'spotify'
cask 'skype'
cask 'zoomus'
cask 'iterm2'
cask 'postman'
cask 'sequel-pro'
cask 'phpstorm'
cask 'bettertouchtool'
cask 'tunnelblick'
cask 'sublime-text'
cask 'spectacle'
cask 'microsoft-edge'
cask 'deluge'
cask 'flux'
cask 'kap'
cask 'microsoft-teams'
cask 'avidemux'
cask 'discord'
cask 'diffmerge'

# Apple Store apps
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835

