cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/php'
tap 'puma/puma'

cask 'xquartz'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yarn'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'cachalot'
brew 'cmake'
brew 'asciinema'
brew 'rethinkdb'
brew 'exiftool'
brew 'php-cs-fixer'

cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'tunnelbear'
cask 'vlc'
cask 'insomnia'
cask 'inkscape'
cask 'rocket-chat'
