cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'wagoodman/dive'
tap 'netlify/netlifyctl'
tap 'amazeeio/lagoon-cli'
tap 'homebrew/cask-drivers'

# Required apps before installing others.
cask 'xquartz'
brew 'mas'

# Brew apps
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'nvm'
brew 'deno'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yarn'
brew 'cmake'
brew 'asciinema'
brew 'rethinkdb'
brew 'exiftool'
brew 'php'
brew 'php-cs-fixer'
brew 'fribidi'
brew 'dive'
brew 'tree'
brew 'wget'
brew 'mariadb'
brew 'direnv'
brew 'ahoy'
brew 'vale'
brew 'tmuxinator'
brew 'git-flow'
brew 'gh'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'go'
brew 'composer'
brew 'contentful-cli'
brew 'netlifyctl'
brew 'gnupg'
brew 'cloudfoundry/tap/cf-cli'
brew 'lagoon'
brew 'awscli'
brew 'fzf'
brew 'swi-prolog'
brew 'doctl'
brew 'thefuck'
brew 'openshift-cli'
brew 'dog'
brew 'raycast'
brew 'k3d'
brew 'podman'
brew 'zopfli'
brew 'glab'
brew 'lab'
brew 'htop'
brew 'ctop'

# Cask applications
cask 'firefox'
cask 'google-chrome'
cask 'lastpass'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'tunnelbear'
cask 'vlc'
cask 'insomnia'
cask 'rocket-chat'
cask 'spotmenu'
cask 'visual-studio-code'
cask 'docker'
cask 'alfred'
cask 'bartender'
cask 'authy'
cask 'kindle'
cask 'spotify'
cask 'skype'
cask 'zoom'
cask 'iterm2'
cask 'postman'
cask 'sequel-ace'
cask 'phpstorm'
cask 'bettertouchtool'
cask 'tunnelblick'
cask 'sublime-text'
cask 'rectangle'
cask 'microsoft-edge'
cask 'deluge'
cask 'flux'
cask 'kap'
cask 'microsoft-teams'
cask 'avidemux'
cask 'discord'
cask 'diffmerge'
cask 'artpip'
cask 'graphiql'
cask 'free-ruler'
cask 'twitch'
cask 'obs'
cask 'istat-menus'
cask 'keybase'
cask 'lando'
cask 'mattermost'
cask 'pocket-casts'
cask 'vnc-viewer'
cask 'db-browser-for-sqlite'
cask 'blackhole'
cask 'lens'

# Apple Store apps
mas "Amphetamine", id: 937984704
#mas "Magnet", id: 441258766
mas "Xcode", id: 497799835

